models/User.php

SELECT EXISTS(SELECT * FROM `nx_user` WHERE `name`='nexona')
SELECT * FROM `nx_user` WHERE name = 'nexa' and password = '3e3806659785b5be6b7a3209212e9f3e'
---
    public function validatePassword () {
        if (!$this->hasErrors()) {
            $data = self::find()->where('name = :name and password = :password',
                [':name' => $this->name, ':password' => NxHelper::md5($this->password)])->one();

INSERT INTO `nx_user` (`name`, `email`, `password`) VALUES ('nexa', 'mcyzlizhun@163.com', '3e3806659785b5be6b7a3209212e9f3e')
---
    public function reg($data) {
        $this->scenario = 'reg';
        if ($this->load($data) && $this->validate()) {
            $this->password = NxHelper::md5($this->password);
            if ($this->save(false))

UPDATE `nx_user` SET `logintime`='1484845309', `loginip`='-1062668543' WHERE name = 'nexa'
---
    public function login($data) {
        $this->scenario = 'login';
        if ($this->load($data) && $this->validate()) {
            $lifetime = $this->rememberMe ? 3600 * 23 : 0;
            $session = Yii::$app->session;
            session_set_cookie_params($lifetime);
            $session['user'] = [
                'name' => $this->name,
                'isLogin' => 1,
            ];
            $this->updateAll(['logintime' => time(), 'loginip' => ip2long(Yii::$app->request->userIP)],
                'name = :name', [':name' => $this->name]);